#include <iostream>
#include <Windows.h>
#define clear system("cls")
#define Pause Sleep(3000)
using namespace std;
int points;
int choise;
int hard;
int main();
void Game();
void Game2();
int PravOtvet(int answer, int PravOtvet, int points) {
	if (PravOtvet == answer)
	{
		clear;
		cout << "[+]Красава!\n";
		Sleep(1500);
		clear;
		return ++points;
	}
	else {
		clear;
		cout << "[+]Мимо мимо!\n";
		Sleep(1500);
		clear;
		if (points <= 0) {
			return points;
		}
		return --points;

	}
}


void Game() {
	int answer = 0;
	int points = 0;
	int fifty = 5;
	setlocale(0, "");

	clear;
	cout << " Вопрос №1 | 2 + 2 * 2 =? \t\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1] 12 \t [2] 6 \t [3] 8 \t [4] 4\n";
	cout << "[+] Выберите ответ: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0) {
		fifty--;
		cout << " Вопрос №1 | 2 + 2 * 2 =? ? \t\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1] \t [2] 6 \t [3]  \t [4] 4\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << " Вопрос №1 | 2 + 2 * 2 =? \t\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1] 12 \t [2] 6 \t [3] 8 \t [4] 4\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №2 | сколько серий в Наруто?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1] 720 \t [2] 499 \t [3] 1000 \t [4] 600\n";
	cout << "Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №2 |сколько серий в Наруто??\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]720 \t [2] \t [3] 1000 \t [4] \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №2 | сколько серий в Наруто?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1] 720 \t [2] 499 \t [3] 1000 \t [4] 600\n";
		cout << "Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №3 |Что приходит в голову здравому пацану в 03:00?\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n" "Нажмите[5]чтобы использовать 50|50 \n\n";
	cout << " [1]Сделать 300 отжиманий, выучить английский и ещё 5 языков , начать заниматься саморазвитием, зарубиться с шайтаном в комнате \n [2]Смотреть Ютуб  \n [3] Смотреть Тик ток \n [4] Депресия \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №3 | Что приходит в голову здравому пацану в 03:00?\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]Сделать 300 отжиманий, выучить английский, начать заниматься саморазвитием, зарубиться с шайтаном в комнате \n [2]  \n [3]  \n [4] Депресия \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №3 |Что приходит в голову здравому пацану в 03:00?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n" "Нажмите[5]чтобы использовать 50|50\n\n" "\n";
		cout << " [1] Сделать 300 отжиманий, выучить английский и ещё 5 языков , начать заниматься саморазвитием, зарубиться с шайтаном в комнате \n [2]Смотреть Ютуб  \n [3] Смотреть Тик ток \n [4] Депресия \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №4 | Когда Вохидову постаят 5 за экзамен?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1] сейчас \t [2] вчера \t [3] чере 5 минут \t [4] через 7 минут \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №4 | Сколько звезд на флаге USA?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1] сейчас \t [2] вчера \t [3]  \t [4] 	\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №4 | Когда Вохидову постаят 5 за экзамен?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1] сейчас \t [2] вчера \t [3] чере 5 минут \t [4] через 7 минут \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №5 |Пары не двоечка можно и пропустить , но...?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1] Без но \t [2]Не у Орлова А.Д \t [3]Нельзя пропускать пары  \t [4] Пойду \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №5 |Пары не двоечка можно и пропустить , но...?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]  \t [2] Не у Орлова А.Д \t [3] Нельзя пропускать пары \t [4]  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №5 |Пары не двоечка можно и пропустить , но...?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1] Без но \t [2]Не у Орлова А.Д \t [3]Нельзя пропускать пары  \t [4] Пойду \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №6 |Какое слово не в ходит в наш словарь?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1]Сдаться\n [2]Сушняк \n [3]Катка\n [4]Похавать\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №6 | Какое слово не в ходит в наш словарь?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]Сдаться\n [2]  \n [3] \n [4]Похавать\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №6 |Какое слово не в ходит в наш словарь?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1]Сдаться\n [2]Сушняк \n [3]Катка\n [4]Похавать\n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №7 |В какую тюрьму не дай Бог сесть?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1]В любую \n [2]Черный дельфин \n [3]Альбатос \n [4]Белый лебедь\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №7 |В какую тюрьму не дай Бог сесть?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]В любую \n [2]Черный дельфин \n [3]  \n [4]\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №7 |В какую тюрьму не дай Бог сесть?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1]В любую \n [2]Черный дельфин \n [3]Альбатос \n [4]Белый лебедь\n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №8 |Как умер Итачи?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1]От рук брата \n [2]Упал с небоскрёба \n [3]Передозировка \n [4]Орочимару убил\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №8 |Как умер Итачи?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1]От рук брата \n [2] \n [3]  \n [4]Орочимару убил  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №8 |Как умер Итачи?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1]От рук брата \n [2]Упал с небоскрёба \n [3]Передозировка \n [4]Орочимару убил\n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №9 |Проиграть можно ....?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1]Если не убежал \n [2]Главное не бояться \n [3]Но ниеогда ты вечишь 100кг \n [4]Но никогда ты лысый \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №9 |Проиграть можно ....?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1]Если не убежал  \n [2] Главное не бояться \n [3] \n [4]  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №9 |Проиграть можно ....?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1]Если не убежал \n [2]Главное не бояться \n [3]Но никогда ты веcишь 100кг \n [4]Но никогда ты лысый \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 2, points);

	clear;
	cout << " Вопрос №10 |Кто пьёт реву?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1]Тюбики \n [2]Бродяги \n [3]Спортсмены \n [4]Программисты \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << " Вопрос №10 |Кто пьёт реву?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1]Тюбики  \n [2 \n [3]Спортсмены  \n [4]  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << " Вопрос №10 |Кто пьёт реву?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1]Тюбики \n [2]Бродяги \n [3]Спортсмены \n [4]Программисты \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);
	clear;
	cout << "Ваши итоговые очки: " << points << endl << endl;;

	cout << "[1]В меню\n ";
	cout << "[2]Мужсксой уровень\n ";
	cin >> answer;
	if (answer == 1)
		main();
	else
		cout << "[1]В меню\n ";
	cout << "[2]Мужсксой уровень\n ";
	if (answer == 2)
		Game2();
	else
		clear;
}
void Game2() {
	int answer = 0;
	int points = 0;
	clear;
	cout << " Вопрос №1 | 2 + 2 * 2 =? \n\n";
	cout << "[1] 12 \t [2] 6 \t [3] 8 \t [4] 4\n";
	cout << "[+] Выберите ответ: ";
	cin >> answer;
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №2 | сколько серий в Наруто?\n\n";
	cout << " [1] 720 \t [2] 499 \t [3] 1000 \t [4] 600\n";
	cout << "Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №3 |Что приходит в голову здравому пацану в 03:00?\n\n";
	cout << " [1]Сделать 300 отжиманий, выучить английский и ещё 5 языков , начать заниматься саморазвитием, зарубиться с шайтаном в комнате \n [2]Смотреть Ютуб  \n [3] Смотреть Тик ток \n [4] Депресия \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №4 | Когда Вохидову постаят 5 за экзамен?\n\n";
	cout << " [1] сейчас \t [2] вчера \t [3] чере 5 минут \t [4] через 7 минут \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №5 |Пары не двоечка можно и пропустить , но...?\n\n";
	cout << " [1] Без но \t [2]Не у Орлова А.Д \t [3]Нельзя пропускать пары  \t [4]Всё равно не пойду\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №6 |Какое слово не в ходит в наш словарь?\n\n";
	cout << " [1]Сдаться\n [2]Сушняк \n [3]Катка\n [4]Похавать\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №7 |В какую тюрьму не дай Бог сесть?\n\n";
	cout << " [1]В любую \n [2]Черный дельфин \n [3]Альбатос \n [4]Белый лебедь\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №8 |Как умер Итачи?\n\n";
	cout << "[1]От рук брата \n [2]Упал с небоскрёба \n [3]Передозировка \n [4]Орочимару убил\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №9 |Проиграть можно ....?\n\n";
	cout << "[1]Но лучше убежать \n [2]Но заднию не давайте \n [3]Но никогда ты веcишь 100кг \n [4]Но никогда ты лысый \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 2, points);

	clear;
	cout << " Вопрос №10 |Кто пьёт реву?\n\n";
	cout << "[1]Тюбики \n [2]Бродяги \n [3]Спортсмены \n [4]Программисты \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Ваши итоговые очки: " << points << "\n";
	Sleep(1500);
	clear;
	main();
}
void regulations() {
	clear;
	cout << "Вечер добрый, а я нет:\n В этой игре мы при помощи вопросов проверим здравость человека.\nКритерии оценивания:\n(1-3)-Явно Тюбик \n(4-6)-Не там не тут \n(7-9)-Нормальный тип \n(10)-НАСТОЯЩИЙ МУЖЧИНА \n\nУдача для неудачников , а вам успехов!";
	cout << "\nВернуться назад [1]\n ";
	int back;
	cin >> back;
	if (back == 1) {
		clear;
		main();
	}
	else {
		clear;
		cout << "Выбран неправаильный ответ ";
	}
}
int main() {
	int answer = 0;
	setlocale(0, "");
	clear;
	cout << "Добро пожаловать ";
	if (hard == 1) {
		cout << "\t\tУровень сложности:" << "Для слабаков" << endl;
	}
	else if (hard == 2) {
		cout << "\t\tУровень сложности:" << "Для Мужчин" << endl;

	}
	else {
		cout << "\t\tУровень сложности:" << endl;
	}
	cout << "[1] Начать игру\n";
	cout << "[2] Настройки\n";
	cout << "[3] Правила\n";
	cout << "[0] Выйти\n";
	int menu;
	cin >> menu;

	if (menu == 1 && hard == 1) {
		Game();
	}
	else if (menu == 1 && hard == 2) {

		Game2();

	}
	else if (menu == 2) {
		clear;
		cout << "[+]Выберите уровень сложности\n\n";
		cout << "[1]Для слабаков\n";
		cout << "[2]Для Мужчин\n";
		choise = 0;
		cin >> choise;
		if (choise == 1) {
			hard = 1;
			clear;
			main();
		}
		else if (choise == 2) {
			hard = 2;
			clear;
			main();
		}
	}
	if (menu == 3) {
		regulations();
	}
}
